In [1]:
import pandas as pd
import numpy as np
import seaborn as sns 
import matplotlib.pyplot as plt
import datetime as dt

In [2]:
data= pd.read_csv("F:\\data\\data.csv",encoding="ISO-8859-1")

In [4]:
data.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [5]:
data['Country'].value_counts()

United Kingdom          495478
Germany                   9495
France                    8557
EIRE                      8196
Spain                     2533
Netherlands               2371
Belgium                   2069
Switzerland               2002
Portugal                  1519
Australia                 1259
Norway                    1086
Italy                      803
Channel Islands            758
Finland                    695
Cyprus                     622
Sweden                     462
Unspecified                446
Austria                    401
Denmark                    389
Japan                      358
Poland                     341
Israel                     297
USA                        291
Hong Kong                  288
Singapore                  229
Iceland                    182
Canada                     151
Greece                     146
Malta                      127
United Arab Emirates        68
European Community          61
RSA                         58
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              30
Bahrain                     19
Saudi Arabia                10
Name: Country, dtype: int64

In [6]:
data1=data[data['Country']=="United Kingdom"]

In [7]:
data1["Country"].value_counts()

United Kingdom    495478
Name: Country, dtype: int64

In [8]:
data1 = data1[data1['Quantity']>0]
data1.shape

(486286, 8)

In [9]:
data1.dropna(subset=['CustomerID'],how='all',inplace=True)

In [10]:
data1.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country'],
      dtype='object')

In [11]:
data1['InvoiceDate'].max()

'9/9/2011 9:52'

In [12]:
data1['InvoiceDate'].min()

'1/10/2011 10:32'

In [13]:
now=dt.date(2011,12,9)
print(now)

2011-12-09

In [14]:
data1['Date']= pd.DatetimeIndex(data1['InvoiceDate']).date

In [15]:

data1.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Date
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,2010-12-01
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,2010-12-01
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,2010-12-01
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,2010-12-01
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,2010-12-01

In [16]:
recency_df=data1.groupby(by=['CustomerID'],as_index=False)['Date'].max()
recency_df.columns=['CustomerID','LastPurshaceDate']
recency_df.head()

   CustomerID LastPurshaceDate
0     12346.0       2011-01-18
1     12747.0       2011-12-07
2     12748.0       2011-12-09
3     12749.0       2011-12-06
4     12820.0       2011-12-06

In [17]:
recency_df['recency']=recency_df['LastPurshaceDate'].apply(lambda x: (now-x).days)

recency_df.head(5)

In [18]:
recency_df.drop('LastPurshaceDate',axis=1,inplace=True)

In [19]:
recency_df.head(5)

   CustomerID  recency
0     12346.0      325
1     12747.0        2
2     12748.0        0
3     12749.0        3
4     12820.0        3

In [20]:
data1_copy= data1
data1_copy.drop_duplicates(subset=['CustomerID','InvoiceNo'],keep='first',inplace= True)
freq_df=data1_copy.groupby('CustomerID',as_index=False)['InvoiceNo'].count()
freq_df.columns=['CustomerID','Frequency']
freq_df.head()

   CustomerID  Frequency
0     12346.0          1
1     12747.0         11
2     12748.0        210
3     12749.0          5
4     12820.0          4

In [21]:
data1.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Date
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,2010-12-01
7,536366,22633,HAND WARMER UNION JACK,6,12/1/2010 8:28,1.85,17850.0,United Kingdom,2010-12-01
9,536367,84879,ASSORTED COLOUR BIRD ORNAMENT,32,12/1/2010 8:34,1.69,13047.0,United Kingdom,2010-12-01
21,536368,22960,JAM MAKING SET WITH JARS,6,12/1/2010 8:34,4.25,13047.0,United Kingdom,2010-12-01
25,536369,21756,BATH BUILDING BLOCK WORD,3,12/1/2010 8:35,5.95,13047.0,United Kingdom,2010-12-01

In [22]:
data1['totalcost']=data1['Quantity']*data1['UnitPrice']

In [23]:
data1.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Date,totalcost
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,2010-12-01,15.30
7,536366,22633,HAND WARMER UNION JACK,6,12/1/2010 8:28,1.85,17850.0,United Kingdom,2010-12-01,11.10
9,536367,84879,ASSORTED COLOUR BIRD ORNAMENT,32,12/1/2010 8:34,1.69,13047.0,United Kingdom,2010-12-01,54.08
21,536368,22960,JAM MAKING SET WITH JARS,6,12/1/2010 8:34,4.25,13047.0,United Kingdom,2010-12-01,25.50
25,536369,21756,BATH BUILDING BLOCK WORD,3,12/1/2010 8:35,5.95,13047.0,United Kingdom,2010-12-01,17.85

In [24]:
Monetary_df= data1.groupby('CustomerID',as_index= False).agg({'totalcost':'sum'})
Monetary_df.columns=['CustomerID','Monrtary']

In [40]:
Monetary_df.head()

   CustomerID  Monrtary
0     12346.0  77183.60
1     12747.0    689.49
2     12748.0   3841.31
3     12749.0     98.35
4     12820.0     58.20

In [41]:
rfm=recency_df.merge(freq_df,on='CustomerID')
rfm.head()

   CustomerID  recency  Frequency
0     12346.0      325          1
1     12747.0        2         11
2     12748.0        0        210
3     12749.0        3          5
4     12820.0        3          4

In [42]:
rfm_df=rfm.merge(Monetary_df,on ='CustomerID')
rfm_df.set_index('CustomerID',inplace=True)

In [43]:
rfm_df.head()

            recency  Frequency  Monrtary
CustomerID
12346.0         325          1  77183.60
12747.0           2         11    689.49
12748.0           0        210   3841.31
12749.0           3          5     98.35
12820.0           3          4     58.20

In [46]:
quantiles=rfm_df.quantile(q=[0,0.25,0.5,0.75])
quantiles

      recency  Frequency  Monrtary
0.00      0.0        1.0       0.0
0.25     17.0        1.0      17.7
0.50     50.0        2.0      45.4
0.75    142.0        5.0     124.5

In [47]:
quantiles.to_dict()

{'recency': {0.0: 0.0, 0.25: 17.0, 0.5: 50.0, 0.75: 142.0},
 'Frequency': {0.0: 1.0, 0.25: 1.0, 0.5: 2.0, 0.75: 5.0},
 'Monrtary': {0.0: 0.0,
  0.25: 17.700000000000003,
  0.5: 45.4,
  0.75: 124.50000000000001}}

In [48]:
# Arguments (x = value, p = recency, monetary_value, frequency, d = quartiles dict)
def RScore(x,p,d):
    if x <= d[p][0.25]:
        return 4
    elif x <= d[p][0.50]:
        return 3
    elif x <= d[p][0.75]: 
        return 2
    else:
        return 1
# Arguments (x = value, p = recency, monetary_value, frequency, k = quartiles dict)
def FMScore(x,p,d):
    if x <= d[p][0.25]:
        return 1
    elif x <= d[p][0.50]:
        return 2
    elif x <= d[p][0.75]: 
        return 3
    else:
        return 4

In [55]:
rfm_df['rencencyscore']=rfm_df['recency'].apply(RScore, args=('recency',quantiles,))
rfm_df['Frequencyscore']=rfm_df['Frequency'].apply(FMScore, args=('Frequency',quantiles,))
rfm_df['Monrtary_score']=rfm_df['Monrtary'].apply(FMScore, args=('Monrtary',quantiles,))

In [56]:
rfm_df.head()

,recency,Frequency,Monrtary,rencency score,Frequencyscore,Monrtary_score,rencencyscore
CustomerID,,,,,,,
12346.0,325,1,77183.60,1,1,4,1
12747.0,2,11,689.49,4,4,4,4
12748.0,0,210,3841.31,4,4,4,4
12749.0,3,5,98.35,4,3,3,4
12820.0,3,4,58.20,4,3,3,4

In [57]:
rfm_df['RFMScore'] = rfm_df.rencencyscore.map(str)  + rfm_df.Frequencyscore.map(str)+ rfm_df.Monrtary_score.map(str)
rfm_df.head()

,recency,Frequency,Monrtary,rencency score,Frequencyscore,Monrtary_score,rencencyscore,RFMScore
CustomerID,,,,,,,,
12346.0,325,1,77183.60,1,1,4,1,114
12747.0,2,11,689.49,4,4,4,4,444
12748.0,0,210,3841.31,4,4,4,4,444
12749.0,3,5,98.35,4,3,3,4,433
12820.0,3,4,58.20,4,3,3,4,433

In [59]:
print("Best Customers: ",len(rfm_df[rfm_df['RFMScore']=='444']))
print('Loyal Customers: ',len(rfm_df[rfm_df['Frequencyscore']==4]))
print("Big Spenders: ",len(rfm_df[rfm_df['Monrtary_score']==4]))
print('Almost Lost: ', len(rfm_df[rfm_df['RFMScore']=='244']))
print('Lost Customers: ',len(rfm_df[rfm_df['RFMScore']=='144']))
print('Lost Cheap Customers: ',len(rfm_df[rfm_df['RFMScore']=='111']))

Best Customers:  370
Loyal Customers:  791
Big Spenders:  980
Almost Lost:  65
Lost Customers:  11
Lost Cheap Customers:  377